docs: mermaid diagrams
